Repository: Tsar-CSX469/lawlink-app
Catalog: lib/l10n/app_*.arb
Languages: si

source: Good Morning
si: සුභ උදෑසනක්

source: Good Afternoon
si: සුභ දහවලක්

source: Good Evening
si: සුභ සන්ධ්‍යාවක්

# welcomeBack
source: Welcome back, {name}!
si: නැවත සාදරයෙන් පිළිගනිමු, {name}!

# welcomeToApp
source: Welcome to LawLink
si: Lawlink වෙත සාදරයෙන් පිළිගනිමු!

# lawGamePlatform
source: Your comprehensive legal education platform
si: ඔබගේ සම්පූර්ණ නීති අධ්‍යාපන වේදිකාව

source: Quiz
si: ප්‍රශ්නාවලිය

# procedures
source: Legal Procedures
si: නීතිමය ක්‍රියාමාර්ග

# acts
source: Legal Acts
si: නීති

source: Leaderboard
si: ප්‍රමුඛතා ලැයිස්තුව

# testYourKnowledge
source: Test your knowledge of Sri Lankan law
si: ශ්‍රී ලංකා නීතිය පිළිබඳ ඔබේ දැනුම පරීක්ෂා කරන්න

# exploreProcesses
source: Explore legal processes and procedures
si: නීතිමය ක්‍රියාමාර්ග සහ ක්‍රම ගවේෂණය කරන්න

# studyLegislation
source: Study Sri Lankan legislation and acts
si: ශ්‍රී ලංකා නීති සහ අයිනය අධ්‍යයනය කරන්න

# competeFriends
source: Compete with friends and track progress
si: මිතුරන් සමඟ තරඟ කර ප්‍රගතිය පිළිබඳව නිරීක්ෂණය කරන්න

source: Settings
si: සැකසුම්

source: Services
si: සේවාවන්

source: Account
si: ගිණුම

source: Preferences
si: මනාපයන්

source: Information
si: තොරතුරු

source: Language
si: භාෂාව

source: Select Language
si: භාෂාව තෝරන්න

source: Dark Mode
si: අඳුරු මාදිලිය

source: Toggle Dark Mode
si: අඳුරු මාදිලිය මාරු කරන්න

source: Toggle Light Mode
si: ආලෝක මාදිලිය මාරු කරන්න

# darkModeComingSoon
source: Dark mode functionality will be available in the next update!
si: අඳුරු මාදිලිය ක්‍රියාකාරිත්වය ඊළඟ යාවත්කාලීනයේදී ලබා ගත හැකිය!

source: Profile
si: පැතිකඩ

source: User
si: පරිශීලක

source: Logout
si: ඉවත් වන්න

# logoutConfirmation
source: Are you sure you want to logout?
si: ඔබට ඇත්තටම ඉවත් වීමට අවශ්‍යද?

source: About
si: පිළිබඳව

# aboutApp
source: About LawLink
si: නීති සම්බන්ධය පිළිබඳව

# aboutDescription
source: LawLink is a comprehensive legal education platform designed to help users learn Sri Lankan law through interactive quizzes, legal procedures, and comprehensive legal acts database.
si: නීති සම්බන්ධය යනු අන්තර්ක්‍රියාකාරී ප්‍රශ්නාවලි, නීතිමය ක්‍රියාමාර්ග සහ සම්පූර්ණ නීති අයිනය දත්ත ගබඩාව හරහා ශ්‍රී ලංකා නීතිය ඉගෙන ගැනීමට පරිශීලකයින්ට උදව් කිරීම සඳහා නිර්මාණය කරන ලද සම්පූර්ණ නීති අධ්‍යාපන වේදිකාවකි.

source: Version
si: අනුවාදය

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

# privacyPolicyContent
source: Privacy Policy for LawLink This Privacy Policy describes how your personal information is collected, used, and shared when you use our application. Information We Collect: • Account information (email, name) • Usage data and preferences • Device information How We Use Your Information: • To provide and maintain our service • To personalize your experience • To improve our application Contact Us: If you have any questions about this Privacy Policy, please contact us.
si: නීති සම්බන්ධය සඳහා පෞද්ගලිකත්ව ප්‍රතිපත්තිය මෙම පෞද්ගලිකත්ව ප්‍රතිපත්තිය ඔබ අපගේ යෙදුම භාවිතා කරන විට ඔබේ පුද්ගලික තොරතුරු එකතු කරන, භාවිතා කරන සහ බෙදා ගන්නා ආකාරය විස්තර කරයි. අප එකතු කරන තොරතුරු: • ගිණුම් තොරතුරු (ඊමේල්, නම) • භාවිත දත්ත සහ මනාපයන් • උපකරණ තොරතුරු අපි ඔබේ තොරතුරු භාවිතා කරන ආකාරය: • අපගේ සේවාව සැපයීමට සහ නඩත්තු කිරීමට • ඔබේ අත්දැකීම පුද්ගලීකරණය කිරීමට • අපගේ යෙදුම වැඩිදියුණු කිරීමට අප සම්බන්ධ කර ගන්න: මෙම පෞද්ගලිකත්ව ප්‍රතිපත්තිය පිළිබඳ ඔබට කිසියම් ප්‍රශ්නයක් ඇත්නම්, කරුණාකර අප සම්බන්ධ කර ගන්න.

source: Quiz Game
si: ප්‍රශ්නාවලිය

# chooseQuizCategory
source: Choose a Quiz Category
si: ප්‍රශ්නාවලි වර්ගයක් තෝරන්න

# testKnowledgeLaw
source: Test your knowledge in different areas of law
si: නීතියේ විවිධ ක්ෂේත්‍රවල ඔබේ දැනුම පරීක්ෂා කරන්න

source: Rankings
si: ශ්‍රේණිගත කිරීම්

source: Consumer Law
si: පරිභෝජක නීතිය

source: Consumer Affairs Quiz
si: පරිභෝජක කටයුතු ප්‍රශ්නාවලිය

source: Criminal Law
si: අපරාධ නීතිය

source: Civil Law
si: සිවිල් නීතිය

source: Employment Law
si: රැකියා නීතිය

source: Restart Quiz
si: ප්‍රශ්නාවලිය නැවත ආරම්භ කරන්න

source: View Leaderboard
si: ප්‍රමුඛතා ලැයිස්තුව බලන්න

# percentage
source: Percentage: {percent}%
si: ප්‍රතිශතය: {percent}%

source: Legal Procedures
si: නීතිමය ක්‍රියාමාර්ග

# stepCompleted
source: Step {stepNumber} completed!
si: පියවර {stepNumber} සම්පූර්ණ කරන ලදී!

source: Comment added successfully
si: අදහස සාර්ථකව එකතු කරන ලදී

source: Failed to add comment
si: අදහස එකතු කිරීමට අසමත් විය

source: Comment deleted successfully
si: අදහස සාර්ථකව මකා දමන ලදී

source: Failed to delete comment
si: අදහස මකා දැමීමට අසමත් විය

source: Delete
si: මකන්න

source: LawLink AI
si: නීති සම්බන්ධය AI

# chatWithAi
source: Chat with our AI assistant for legal guidance
si: නීතිමය මාර්ගෝපදේශ සඳහා අපගේ AI සහායක සමඟ කතා කරන්න

source: OK
si: හරි

source: Cancel
si: අවලංගු කරන්න

source: Yes
si: ඔව්

source: No
si: නැත

source: Coming Soon
si: ඉදිරියේදී

source: Soon
si: ඉක්මනින්

# comingSoonExclamation
source: Coming Soon!
si: ඉදිරියේදී!

# featureComingSoon
source: This feature will be available in a future update.
si: මෙම විශේෂාංගය අනාගත යාවත්කාලීනයකදී ලබා ගත හැකිය.

# quizWillBeAvailable
source: {quizType} quiz will be available in a future update!
si: {quizType} ප්‍රශ්නාවලිය අනාගත යාවත්කාලීනයකදී ලබා ගත හැකිය!
